{
  "umbrawindowtinting.com": [
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "WINDOW TINT WITH A LIFETIME WARRANTY*",
    "Guaranteed to Perform Down the Road: When professionally installed by Umbra Window Tinting's trained technicians, LLumar FormulaOne Auto Window Films are guaranteed to stand up to the test of time and comes with a LIFETIME WARRANTY*. So don't waste your time and money buying cheap window film that you will need to replace or fix. We guarantee that our advanced technology will keep your auto window tint from changing color, bubbling, and cracking as long as you own your vehicle. So be confident your car, SUV, or truck will always look great inside and out.",
    "Protect Your Car’s Paint: The sun's harmful UV rays can be harsh, so protecting your car's paint from climatic change, road debris, bugs, sand, salt, and various chemicals should be a priority. Paint Protection Film (PPF) defends against anything the road throws your way making your car look newer longer. A virtually invisible urethane film protects your vehicle's paint from unsightly damage and helps maximize your car's resale value. Some of its features include Self Healing, Stain Resistance and Superior Optical Clarity.",
    "Enhance Your Car's Shine and Gloss: Have you ever wished that your vehicle would look as new as the day you drove it off the dealership lot? Car Ceramic Coating helps make that wish come true! Cars with a ceramic coating will shine and look closer to new for a longer period of time. Their translucent, second-skin coating will protect a fresh paint job on a new car and keep it looking glossy. It also helps keep the car cleaner for longer and makes the car easier to clean when the time does come for a wash.",
    "5078",
    "Ceramic Coating",
    "7545",
    "Paint Protection Film",
    "9857",
    "Auto Window Tinting",
    "WINDOW FILM & PPF VIEWERS",
    "Take the guesswork out of choosing the right film for your car, truck, or SUV.",
    "GET FREE ESTIMATE NOW!",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Color:",
    "Service:",
    "Auto Window Tinting",
    "Paint Protection Film",
    "Ceramic Coating",
    "Other",
    "Select:",
    "2 DR",
    "4 DR",
    "Hatch",
    "Wagon",
    "Other",
    "Old tint need to be removed?",
    "Yes",
    "No",
    "Shop Location",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comment:",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "WINDOW TINT WITH A LIFETIME WARRANTY*",
    "Guaranteed to Perform Down the Road: When professionally installed by Umbra Window Tinting's trained technicians, LLumar FormulaOne Auto Window Films are guaranteed to stand up to the test of time and comes with a LIFETIME WARRANTY*. So don't waste your time and money buying cheap window film that you will need to replace or fix. We guarantee that our advanced technology will keep your auto window tint from changing color, bubbling, and cracking as long as you own your vehicle. So be confident your car, SUV, or truck will always look great inside and out.",
    "Protect Your Car’s Paint: The sun's harmful UV rays can be harsh, so protecting your car's paint from climatic change, road debris, bugs, sand, salt, and various chemicals should be a priority. Paint Protection Film (PPF) defends against anything the road throws your way making your car look newer longer. A virtually invisible urethane film protects your vehicle's paint from unsightly damage and helps maximize your car's resale value. Some of its features include Self Healing, Stain Resistance and Superior Optical Clarity.",
    "Enhance Your Car's Shine and Gloss: Have you ever wished that your vehicle would look as new as the day you drove it off the dealership lot? Car Ceramic Coating helps make that wish come true! Cars with a ceramic coating will shine and look closer to new for a longer period of time. Their translucent, second-skin coating will protect a fresh paint job on a new car and keep it looking glossy. It also helps keep the car cleaner for longer and makes the car easier to clean when the time does come for a wash.",
    "5078",
    "Ceramic Coating",
    "7545",
    "Paint Protection Film",
    "9857",
    "Auto Window Tinting",
    "WINDOW FILM & PPF VIEWERS",
    "Take the guesswork out of choosing the right film for your car, truck, or SUV.",
    "GET FREE ESTIMATE NOW!",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Color:",
    "Service:",
    "Auto Window Tinting",
    "Paint Protection Film",
    "Ceramic Coating",
    "Other",
    "Select:",
    "2 DR",
    "4 DR",
    "Hatch",
    "Wagon",
    "Other",
    "Old tint need to be removed?",
    "Yes",
    "No",
    "Shop Location",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comment:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "UMBRA WINDOW TINTING SERVICES",
    "Offering the Best Window Tinting, Paint Protection Film (PPF) and Ceramic Coating Services for Schaumburg, Glendale Heights, and The Greater Chicago Region",
    "AUTO WINDOW TINTING",
    "LEARN MORE",
    "PAINT PROTECTION FILM",
    "LEARN MORE",
    "CAR CERAMIC COATING",
    "LEARN MORE",
    "GET FREE ESTIMATE NOW",
    "CLICK HERE",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "BENEFITS OF AUTO WINDOW TINTING",
    "At Umbra Window Tinting in Schaumburg, Auto Window Film is more than just tint. It’s an upgrade for auto glass with benefits beyond anything factory delivered. Explore shades ranging from limo dark to nearly clear, combined with premium features to improve your car both inside and out.",
    "FORMULAONE",
    "Block Dangerous UV Rays",
    "Window tint blocks UV rays to help reduce your risk of skin cancer.",
    "Did you know drivers in the U.S. have a higher rate of skin cancer on their left side due to exposure while driving?",
    "Here’s a scientific fact that most people find hard to believe: While it’s rare to get sunburned through your car windows, harmful ultraviolet (UVA) rays that contribute to premature aging and skin cancer can still reach you.",
    "Damage from UVA rays is cumulative as they penetrate deep into the skin and can silently accelerate the aging process, cause wrinkles and even skin cancer. In fact, research shows that drivers in the U.S. have a higher rate of skin cancer on their left side due to exposure while driving.",
    "Why put up with this risk when you don’t have to any longer? Our premium window tints blocks more than 99% of harmful UV rays. It’s why The Skin Cancer Foundation recommends window tint as part of a comprehensive skin care program.",
    "Why let excessive heat and glare ruin your ride?",
    "Make your road trips more comfortable by adding window tint to your car, truck, or SUV.",
    "It’s no secret the sun’s rays can cause car interiors to become unbearably hot. But you can keep your cool.",
    "During the hot summer months, there seems to be no escape from the blazing heat of the sun — even in your car. You start off running the air conditioning at a low setting and before you know it, you're at full blast. And when you do hit the road, blinding glare can often be a dangerous distraction.",
    "Window tint can change all that — putting you back in control for a cooler, more comfortable ride. By blocking more than 99% of harmful ultraviolet (UV) rays, our premium brand window tints protects passengers from skin damage and the interior of your vehicle from fading and cracking. And on the road, window tint helps reduce blinding glare and painful eye strain.",
    "You can choose from a variety of shades at Umbra Window Tinting — from light to dark — that will provide privacy for you, your passengers as well as your belongings. Ride safer, cooler and in greater comfort by adding window tint to your vehicle. Window tint is recommended by The Skin Cancer Foundation as part of a comprehensive skin care program.",
    "Enhance the Style and Appearance of your Vehicle",
    "Do you want your car to stand out from the crowd? Sure you do. Whether you want your ride to look elegant with clear and invisible window films, or scorching hot– Our window tint can help make it happen. In fact, when you have our window tint professionally installed on your car, you not only get the look you want but the privacy you seek from the outside world.",
    "Customize your ride with window tint so it’s as cool as you.",
    "Auto enthusiasts agree that tinting car windows offers the most stylish appearance of any window tint on the market.",
    "A wide variety of shades from light to dark including ceramic tint that maximizes heat and ultraviolet rejection, keeping you and your vehicle cool and helping to protect from the damaging effects of the sun",
    "Soft charcoal color matches factory privacy glass",
    "Privacy for passengers and belongings",
    "With our exclusive range of window tints, you can choose a look for your car that truly complements your personality. Plus, you can rely on high performance and maximum UV protection.",
    "Keeps vehicle cooler and more comfortable",
    "Provides more than 99% Ultraviolet (UV) protection",
    "Helps protect upholsteries from fading and cracking",
    "AUTO FILM VIEWER",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "FORMULAONE HIGH PERFORMANCE AUTO WINDOW TINT",
    "The Ultimate in Appearance, Comfort and Protection",
    "THE EXCLUSIVE DEALER OF FORMULAONE AUTO WINDOW TINT FOR SCHAUMBURG AND THE GREATER CHICAGO REGION",
    "Raise Your Expectations for FormulaOne High Performance Auto Tint",
    "Get the ultimate in appearance, comfort, and protection with FormulaOne high performance auto tint by LLumar. This exclusive automotive tint is manufactured to meticulous standards and rigorously tested, to help ensure it lives up to the promise of a better driving experience.",
    "FormulaOne is available only through an elite network of LLumar SelectPro Dealers. As a SelectPro Dealer, Umbra Window Tinting has proven consistently offering exceptional customer service and installation skills. So have peace of mind knowing you can trust Umbra Window Tinting to treat you and your vehicle with the utmost attention.",
    "Now drivers can have the ultimate in appearance, comfort and protection from an exclusive line of window tint that creates a driving experience that is like no other.",
    "In just minutes, the hot Chicago summer sun can send the interior temperature of your car skyrocketing to up to 150°F – making your drive not only uncomfortable, but possibly dangerous. With FormulaOne automotive window film from Umbra Window Tinting in Chicago, you can reduce the temperatures inside your car by up to 65% before you even turn the air conditioner on! Say goodbye to blistering leather seats and a blazing steering wheel. FormulaOne car window tinting takes the strain off your air conditioning system, helping you to save on fuel and subsequently costs at the pump. Plus, our informed team members can educate you on Illinois window tinting laws as outlined in bill HB3325. Passed in 2009, this bill allows tinting of front and rear windows on passenger vehicles according to the following guidelines:",
    "Option 1 – Both front and rear windows can be tinted up to 35%.",
    "Option 2 – For darker back windows, you can go up to 30-35% net darkness. However, then the front windows may only have up to 50% tinting.",
    "Option 3 – If rear windows are tinted below 30%, the front windows cannot have a tint. Vehicles equipped with factory rear tint are permitted to have up to 50% tint for front windows.",
    "WHAT ELEVATES FORMULAONE TINT",
    "Advanced Construction",
    "We use our most premium manufacturing techniques, materials and engineering to create long-lasting FormulaOne tint.",
    "Color-Stable Dye",
    "FormulaOne tint has premium charcoal dye embedded in it instead of being applied to the surface for more durability.",
    "UV Ray Protection",
    "Exposure to UV rays contributes to cracking and fading in your vehicle’s interior. FormulaOne blocks 99% of harmful UV rays.",
    "Our Best LIFETIME Warranty",
    "All FormulaOne products come with transferable lifetime limited warranty* coverage that travels with the title of your vehicle.",
    "LLumar SelectPro Dealers",
    "FormulaOne is offered exclusively by this elite group of professionals, recognized for their impeccable service and installation.",
    "When it comes to your car, you never settle for second best. You want the best of everything. That’s why there’s FormulaOne High Performance Window Tint by LLumar — the best in the industry.",
    "Appearance",
    "FormulaOne High Performance Auto Tint by LLumar takes advantage of the latest innovations and technologies to ensure a beautiful, long-lasting appearance – keeping your car’s interior looking newer longer. With a broader range of shades to choose from, you’re sure to -find the one that fits your style.",
    "Comfort",
    "A cooler interior is another reason you’ll be comfortable with your decision. Blocking more heat will help you experience a comfortable cabin environment, allowing you to run your air conditioner less, improving fuel economy.",
    "Performance",
    "It's the difference between style and substance. It's the extra mile that you put into your vehicle and that you expect from the products you buy. FormulaOne High Performance Auto Tint® has been specially designed to give you the highest heat and glare reduction on the market - improving comfort and helping take the strain off of your AC.",
    "Precision",
    "The ability to be precise is the ability to excel. FormulaOne High Performance Auto Tint is manufactured and engineered with the utmost precision by the world's leader in applied films. Every product is backed with a lifetime manufacturer's warranty*. The quality and consistency of our films is matched only by the select few that qualify to be authorized FormulaOne dealers and installers.",
    "Protection",
    "While many films simply look good, FormulaOne High Performance Auto Tint provides you and your vehicle with the highest UV protection in the industry - keeping your car's interior looking newer longer, and helping shield you and your passengers from UV exposure. FormulaOne High Performance Auto Tint provides a protective barrier that reduces glare, while shielding you and your passengers from more than 99 percent of damaging UV rays. It also provides exceptional protection from the sun’s harmful rays, which can cause a vehicle’s interior to fade and crack.",
    "Unmatched Warranty and Support",
    "Not only does FormulaOne High Performance Auto Tint by LLumar add overall comfort to your driving experience, but it also provides you comfort in knowing you are backed by the industry’s best warranty, the unsurpassed FormulaOne National Manufacturer’s Warranty*. Your vehicle is protected for as long as you own it, with a warranty that can be transferred to subsequent vehicle owners.",
    "*Certain restrictions apply; see an authorized dealer for warranty details.",
    "FORMULAONE AUTO WINDOW TINT OPTIONS",
    "High-Quality FormulaOne Auto Tint for Every Need",
    "FORMULAONE SPEC SHEET",
    "Manufactured and engineered with the utmost precision by the world’s leader in applied films, FormulaOne car window film delivers strength and durability unmatched by competitors. It utilizes top-notch materials and high-performance adhesive to keep your vehicle looking as new as the day it rolled off the lot. At Umbra Window Tinting, we offer a wide range of FormulaOne window films, all designed to provide outstanding protection and stylish good looks.",
    "FormulaOne Stratos Series",
    "The most luxurious tint we offer with our highest heat-rejecting power, sun protection and style. Made with concentrated nano-ceramic construction. Our new proprietary hybrid-matrix technology utilizes multiple layers made up of billions of nanoscopic particles to create advanced infrared absorbing properties. This film rejects up to 63% of solar heat to enhance your driving experience. And it shields your passengers from more than 99% of harmful UV rays* while it helps reduce interior fading and cracking due to UV ray exposure.",
    "Our maximum heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Pinnacle Series",
    "The Pinnacle Series delivers the ultimate all-around performance in automotive window tint. The innovative nano-ceramic construction offers our maximum heat and UV protection along with glare reduction without interfering with signals from electronic devices. The Pinnacle Series gives this ultra-premium tint elevated heat rejection and improved glare reduction, along with sleek style.",
    "Outstanding heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Comfort Series",
    "FormulaOne Comfort window tint is a deluxe version of LLumar®’s heat-blocking, glare-fighting metallized and dyed tint. It has tough scratch resistance, premium color-stable dye, and the power to block more than 99% of harmful UV rays. Whether you decide on a dark limo shade or something more subtle, you’ll love the results. Premium film with a metallized layer that helps reflect away the sun’s harsh heat and glare; has a reflective look different from other films.",
    "Excellent heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Classic Series",
    "When it’s all about the look of your vehicle and the image you want to project, the go-to choice is Classic Series. The soft charcoal look is available in a variety of shades. Select the auto window tint that complements your style then enjoy the enhanced look of your car. Made with our deluxe, deep-dye construction for true charcoal color. Other brands skip this step and are more likely to discolor.",
    "Good heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "AIR Series Clear Window Film",
    "This nearly clear film helps keep your vehicle cooler without the dark appearance of traditional tint. When you want to help protect yourself, your passengers and your car interior from harmful UV rays and you want to reduce interior heat, AIR Series window film is for you. It has the same, proven nano-ceramic construction used in premium auto tint, minus the window-darkening color.",
    "AIR window film is almost impossible to see. But when it comes to comfort and safety, it has a major impact on the way you feel. With LLumar AIR clear window film you get:",
    "LEARN MORE",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "PAINT PROTECTION FILM (PPF) SCHAUMBURG",
    "Stop Fearing Chips, Scratches, Rocks, Sand and Salt",
    "WHAT PAINT PROTECTION FILM CAN DO FOR YOU",
    "Our barely detectable paint protection films are the smart, easy way to keep your factory or custom paint finish looking fresh and flawless for miles. We offer several levels of protection, so you can choose the level of defense that fits your needs. No matter which option you choose, you’ll appreciate what this specialty film’s self-healing properties do for the life of your finish – and for your life on the road.",
    "Twart Everyday Road Damage",
    "This film’s self-healing surface significantly improves the performance and durability of automotive paint finishes.",
    "Shield Against Nicks & Scratches",
    "Over time, this minor damage takes away from the beauty of your finish. Added protection helps keep it fresh and new looking.",
    "Match Your Vehicle's Paint Finish",
    "Gloss and matte options match factory and custom paints, so it’s difficult to detect where paint protection film has been installed.",
    "Provide Excellent Resistance to Stains",
    "Excellent resistance to yellowing and stains from dirt, oil, tar and bugs helps keep your paint color true and fresh looking longer.",
    "Add Outstanding Surface Durability",
    "Our advanced Hydrogard™ technology is designed to add water resistance and enhance the durability of your vehicle’s exterior.",
    "Ensure Many Years of Satisfaction",
    "We promise to protect your investment in automotive film and installation with a Limited 10 Year Manufacturer's Warranty.",
    "AUTO PAINT PROTECTION FILM DEFENDS AGAINST ANYTHING THE ROAD THROWS YOUR WAY",
    "Nearly invisible and powerful enough to repel things that normally wreak havoc on high-impact areas, our protective films shield your car during highway travel, city living, and bumps, drops, and oopses — without uneven paint wear. We keep small imperfections from becoming big annoyances.",
    "Rocks, stones & gravel, bug acid bird droppings and tree saps salt and chemicals… They take their toll on your vehicle’s finish and sanity. Keep your vehicle looking new for years to come by wrapping it in a virtually invisible protective shield.",
    "The first scratch hurts the most. So prevent the pain and keep your car looking newer longer with one of the highest quality, most durable paint protection films in the industry. A high-gloss, virtually invisible shield, our paint protection film shields your car from the damages of everyday driving.",
    "The ultimate defense against road rash:",
    "Rocks and pebbles",
    "Road debris",
    "Winter salt and sand",
    "Our self-healing paint protection film offers a strong defense when it comes to shielding the areas of your vehicle that are most vulnerable to damage, such as:",
    "Hood",
    "Bumpers",
    "Door edges, handles and steps",
    "Side-view mirrors",
    "Rocker panels",
    "Fenders",
    "Our goal is to protect the vehicle while at the same time having it look like nothing is there.",
    "Eliminates stone chips and road rash",
    "Self healing surface erasing light defects",
    "Stain and scratch resistant",
    "High gloss & optical clarity",
    "100% UV stable",
    "Warranty against cracking, peeling and yellowing",
    "Enhances your car’s style",
    "PPF has a clear, high-gloss finish that provides industry-leading optical clarity – allowing the true colors of your car to shine through. Plus, the clear bra has self-healing abilities so if scratched, it returns to it’s original state after sitting under the sun or by applying heat. It’s also resistant to cracks, yellowing, and also staining.",
    "Custom fits your vehicle",
    "Unlike other protection products, our car paint protection film doesn’t require drilled holes or special fasteners. All film is computer cut and applied by our team of professionals to fit your vehicle’s exact specifications.",
    "Delivers peace of mind",
    "You can wash, wax and care for your car just as you always have once clear bra is installed. Additionally, paint protection film is covered by a 10-year manufacturer’s warranty.",
    "HELP KEEP YOUR CAR LOOKING NEWER LONGER WITH OUR SELF-HEALING PAINT PROTECTION FILM",
    "We also protect your peace-of-mind. At Umbra Window Tinting in Schaumburg, our Clear Bra Film is professionally installed by qualified expert PPF Installers. The film's clear coat finish self-heals when scratched and is resistant to cracks, yellowing and staining. To ensure the perfect fit, each piece is custom cut to match your vehicle. Our paint protection film has the protection that’s a perfect fit.",
    "Caring for your car is easy with our paint protection film, you can wash your car just like you normally would. Using a factory-recommended wax will keep your vehicle looking like the day it was installed. Whatever you drive; car, SUV, crossover or truck, we provide the best option for keeping your vehicle's paint protected for years to come.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "XPEL PAINT PROTECTION FILM",
    "FREE ESTIMATE",
    "EXPLORE XPEL PAINT PROTECTION FILMS",
    "Need Paint Protection Film (AKA Clear Bra)? XPEL offers a variety of self-healing paint protection films and DIY solutions to keep your car looking its best.",
    "ULTIMATE PLUS",
    "Gloss Is Boss",
    "ULTIMATE PLUS is one of the most advanced paint protection films on the market. Available in three different thicknesses to offer you the protection you need for exterior and interior surfaces. The entire ULTIMATE PLUS line up is virtually invisible and provides protection from everyday damages including scuffs, scratches, chips and more. It protects your vehicle's paint from unsightly damage and maximizes re-sale value. Some of its features include Self Healing, Stain Resistance and Superior Optical Clarity.",
    "STEALTH",
    "As Smooth As Satin",
    "Finally, A Paint Protection Film Specifically Formulated For Preserving A Flat Factory Finish. As smooth as satin. Whether your vehicle is matte, magno, frozen or frosted, self-healing STEALTH will keep it looking effortlessly pristine. Or, protect your gloss paint with a whole new look! With an unique satin finish, STEALTH helps match most factory flat paint jobs and virtually disappears on most surfaces. With a finish that’s uniformly smooth, you can add STEALTH to your matte or gloss paint job for a unique satin finish.",
    "ARMOR",
    "It's Rugged By The Roll",
    "XPEL ARMOR provides a textured, bed-liner aesthetic in an easy-to-apply film that's 13 mils thick. Designed for off-road, industrial, and commercial use, ARMOR can give your rig the look you want with the protection it deserves. Rugged protection that defends against scrapes, scratches, scuffs, gravel strikes, and other hazards with protection you can see and feel. ARMOR can be used to cover existing damage on surfaces while simultaneously protecting from new impacts or abrasion for a unified look all around.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "LLUMAR PAINT PROTECTION FILMS (PPF)",
    "Protect your car's paint from scratches, rocks, chips, salt, and whatever hazards the road throws your way with LLumar Clear Bra PPF",
    "DRIVE CONFIDENTLY WITH LLUMAR CLEAR BRA PPF",
    "LLumar Paint Protection Film (PPF) Brands makes it easy to keep your car’s finish looking like you just drove off the lot. Paint protection film effectively stands up to flying rocks, bird droppings, salt, sand and more. We offer multiple finishes, innovative 2-in-1 products, and go-to favorites, all of which are self-healing, extensively tested, and factory-backed. Decide what coverage you need, select your product and take any road with confidence.",
    "Quality you can count on",
    "Proudly made in the U.S.A. of globally sourced materials, LLumar Platinum Paint Protection Film helps protect car finishes from paint chips and scratches. LLumar products are recognized for their outstanding appearance and durability. We proudly stand behind our products. This, along with a reputation for quality and innovation, has made LLumar one of the best-selling and most-respected paint protection film brands in the world.",
    "LLUMAR PAINT PROTECTION FILM (PPF) OPTIONS",
    "Superior Car Paint Protection from the Hazards of the Road",
    "Valor PPF Series",
    "Paint Protection Film + Ceramic Coating Benefits",
    "Get the sought-after benefits of premium PPF and easy-wash ceramic coating with 2-in-1 Valor, featuring our OEM-trusted Tetrashield™ technology.",
    "Super hydrophobic surface with deep gloss",
    "Stands up to corrosives like bird droppings",
    "Select Black PPF Series",
    "Transform your paint color to a rich, glossy black with all the protective benefits of our Platinum PPF.",
    "Transform your paint color to a rich, glossy black with all the protective benefits of our Platinum PPF.",
    "Restyle and protect with just one installation",
    "More affordable than paint and tougher than vinyl",
    "Full wrap or accents on bumpers, mirrors, etc.",
    "Platinum Extra PPF Series",
    "Hard-wearing defense for extreme driving conditions",
    "Our highest impact resistance in a thicker, stronger PPF made for gravel roads, track racing, and harsh weather.",
    "Chip-fighting, high-impact finish defense",
    "Ideal for areas highly vulnerable to damage",
    "Backed by a 10-year limited warranty*",
    "Platinum Gloss PPF Series",
    "Helps defends a new car's finish against the hazards of the road",
    "A favorite of auto enthusiasts and purists; helps your vehicle retain its value by defending the finish.",
    "High-shine top-coat blends with factory paint",
    "HydroGard™ for stain resistance and durability",
    "Platinum Matte PPF Series",
    "Transforms your vehicle’s finish with serious defense",
    "All the features of our Platinum PPF, in a standout flat finish that can transform glossy paint or blend with custom matte paint.",
    "For a flat finish with added protection",
    "Beads water, fights stains and self-heals",
    "Gloss and Matte PPF Series",
    "Keep your shiny or flat finish safe from everyday road damage",
    "Affordable, extensively road-tested, and made to help keep high-shine or flat finishes looking as pristine as possible for years.",
    "Available in gloss or matte finish",
    "Self-heals with sun or engine heat",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "CERAMIC COATING SCHAUMBURG",
    "Paint Coating That Offers the Highest Level of Slickness, Protection, & Durability",
    "WHAT IS CERAMIC COATING?",
    "KENZO IGL COATINGS",
    "Ceramic coatings are the new standard of protection for your car. Ceramic coatings is designed to protect your vehicles from external damage to keep them in pristine condition for many years. These ceramic coatings are typically made from silica or silicon dioxide for a nano-based liquid that hardens into a nearly impermeable shell. In addition, this coating is completely clear, preserving the exact color of your vehicle for years.  These coatings chemically bonds to the existing clear-coat on your vehicle to act as a barrier between the original clear-coat from the manufacturer and the elements from the environment. These coatings provides more durability than your average wax or sealant. Think of it as a second layer of clear coat, which wraps your paint, wheels, trim or glass in an ultra durable ceramic layer of protection. Forget waxing and sealing every few month, ceramic coatings protect your vehicle for upwards of 18 to 25 months, sustaining that deep wet gloss while making your paintwork much easier to clean and maintain. The makeup of the coatings we offer vary but generally contain SiO2 (quartz) as their primary active ingredient which crystallizes and forms a strong and durable layer over a particular area of your vehicle.",
    "Ceramic Coating helps make your vehicle look as new as the day you drove it off the dealership lot! A Ceramic Coating is a clear multi-layer liquid polymer that gives your vehicle outstanding external protection and durability. It is applied by hand as an alternative to wax. A chemical reaction and bond forms adhering to the factory paint allowing for a smooth clear coat like finish.",
    "Ceramic Coating chemically bonds with your car’s exterior, creating a new layer of protection and easier maintenance",
    "A Ceramic coating keeps your car cleaner for a longer period of time and dramatically cuts down the amount of time you have to spend to wash it. We use IGL Kenzo supplied by IGL Coatings which can only be used my approved IGL detailers. This product is not available to entry-level detailers or shops so you can trust your in experienced hands.",
    "We apply 2 layers total with high-chemical resistance and an immediate increase in gloss! This product is rated at 10h hardness which is known to reduce the chances of marring or scratches. Kenzo requires absolutely ZERO maintenance. Unlike other brands, Kenzo will not need a topper every 6 months so once the coating is applied and dried, your set to go!",
    "WHY YOUR CAR NEEDS CERAMIC COATING?",
    "Whether you own or lease your car, protecting the quality of its paint plays a significant role in maintaining its trade-in value. One of the biggest values of ceramic coating is that it doesn’t waste time defending your investment. Your car’s paint looks as glossy as its first day off the lot. Water and dirt repel off your clear coat with ease. More importantly, it acts as a shield from damage (UV oxidation, chemical etching, and light scratches) that goes unseen until it’s too late.",
    "Prevents Oxidation",
    "The sun is a vehicle's worst enemy in the hot summer months. Harmful and destructive Ultraviolet Rays eat into a vehicle's paint finish causing a fading, deteriorating, spotty look which is unpleasant. With a Ceramic Coating, your vehicle can hide from the sun's harmful power, prolonging the factory paint and avoiding the process of oxidation.",
    "Worry Free Detailing",
    "The Ceramic Coating, once applied, repels water and harmful chemicals which makes cleaning your car a breeze. Dirt and grime will rinse off effortlessly because of the smooth Ceramic Coating. Minor scratches and blemishes can be easily removed without harming the Ceramic Coating. The coating also helps prevent water spots from forming after you wash your vehicle. In some cases, hard water is present and tends to leave spots on your vehicle. The smooth Ceramic Coating helps repel the hard water to leave less water spots.",
    "Ever Lasting Gloss",
    "Ceramic Coating enhances your vehicles shine and gloss. The reflective properties inside the Ceramic Coating gives your vehicle a new car look. This is essentially an upgrade from your factory paint job to get the most visual effect out of your vehicle's appearance at an affordable price.",
    "BENEFITS OF CERAMIC COATING",
    "Super thick layer",
    "Extremely deep rich gloss ( hard candy shell appearance)",
    "Ease of maintenance / self cleaning properties",
    "Resistance to wash induced marring",
    "Protection from UV rays",
    "Resistance to extreme temperatures",
    "Resistance to stains, bird droppings, water spots, traffic film",
    "Repels water, oil, dirt",
    "Warranty",
    "WHY CHOOSE CERAMIC COATING SERVICES",
    "GOOD",
    "INVESTMENT",
    "The coating will protect the vehicle’s exterior and interior from deteriorating. The resale market value will therefore be substantially higher! Ceramic Coating pays for itself in the end.",
    "LOOK NEW",
    "ALL THE TIME",
    "Once the coating is applied you will see a mirror effect, glossiness and color depth, incomparable to anything else! With proper maintenance your car’s finish will shine for many years to come.",
    "LESS",
    "MAINTENANCE",
    "The slick coated surface won’t allow dirt, brake dust and tar to stick to your paint, wheels or glass. This makes washing your vehicle less labor intensive and less frequent. Waxing is now obsolete.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "KENZO IGL CERAMIC COATINGS",
    "Approved Installer of IGL Coatings",
    "About Kenzo by IGL Coatings",
    "Kenzo is IGL Coatings' Flagship REACH compliant ceramic coating which pioneered the 100% active material formulation for ceramic coatings. Synthesised using the latest nanotechnology and graphene nano-platelets, the new and improved Graphene Reinforced Ecocoat Kenzo has an increased durability of up to 5 years and a higher resistance to water-spots. Ecocoat Kenzo’s unmatched clarity and gloss radiates a rich and natural glow reminiscence of bespoke wax and its thick 10H hardness layer protects 12 times longer than waxes.",
    "Kenzo is a revolutionary paint protection coating that contains 100% silica providing the highest level of gloss and protection and is backed by an official warranty provided by IGL Coatings and supported by certified IGL Coatings Master Applicator. It forms a layer of thick coating that radiates a rich and natural glow reminiscence of a bespoke wax while providing unmatched protection. Running your hands across a Kenzo coated car is like touching the soft luxurious silk. It will never be the same again. Kenzo IGL Coatings is only available to and exclusively installed by IGL Authorized Kenzo Installers that had mastered the highest level in paint correction and the art of coating application.",
    "Why Kenzo Ceramic Coatings",
    "If you are looking to preserve the value and look of your new prized ride or want your older car to be restored to it's new look and protected from the harsh elements, our Ceramic Coating solutions is your answer. Unlike a car wash & wax that can lasts for only a short period of time, getting your car treated with Ceramic Coating will last for years and will help keep that shine and add protection from bird droppings, water marks, scratches, paint transfer, and whatever the road throws your way. Ceramic coatings also give the great hydrophobic benefits of allowing water and dirt to run right off your vehicle. This makes cleaning your car, truck, or SUV even easier.",
    "Benefits of Kenzo IGL Ceramic Coatings:",
    "Preserve the original paintwork",
    "Reduced paint marring",
    "Reduced contaminants etching",
    "Ease of cleaning",
    "Extremely deep rich gloss ( hard candy shell appearance)",
    "Protection from UV rays",
    "Resistance to extreme temperatures",
    "Resistance to stains, bird droppings, water spots, traffic film",
    "Repels water, oil, dirt",
    "Super thick layer",
    "Warranty",
    "Kenzo Ceramic Coatings improves resistance against:",
    "Sunshine & UV",
    "Acid Rain",
    "Bird Droppings",
    "Water spots",
    "Brake Dust",
    "Chemicals",
    "Insects & Bugs",
    "Paint Marring",
    "Road Grit",
    "Rust",
    "Tree Sap",
    "HIGH SOLIDS",
    "100% active material content and 0% solvent creating a thick film build",
    "EXTREME HARDNESS",
    "Crosslinks and full cures to hardness of up to 10H (pencil scale)",
    "SELF CLEANING",
    "Surface stays clean for a longer period thanks to the self cleaning effect",
    "SILKY SMOOTH SURFACE",
    "First coating to provide a texture similar to soft luxurious silk that rivals bespoke wax",
    "WATERSPOT RESISTANCE",
    "Improved formulation to increase the resistance of water spotting on coated vehicles",
    "SUPERB HYDROPHOBIC QUALITY",
    "Water contact angle that surpasses 120° and retaining close to this angle for a long period",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "RESIDENTIAL WINDOW TINTING SCHAUMBURG",
    "Home window tinting can turn your house into a safer, more comfortable place to live.",
    "BENEFITS OF HOME WINDOW TINTING",
    "1. Protection from dangerous ultraviolet rays.",
    "2. Reduce Heat to make your home comfortable for you and your family.",
    "3. Energy savings when the window films filter what is allowed in and out of your windows.",
    "4. Safety and security in knowing that our window films protect your family and home from dangerous blowing glass in a natural disaster.",
    "5. Reduced fading on your hardwood floors, upholstery, window treatments, and so much more.",
    "6. Eliminate the glare on your electronics and stop internal glare from blocking your view at night.",
    "7. Maintain the value of your home and get a tax credit with the The Energy Policy Act of 2005.",
    "Ultraviolet (UV) protection for your home and family",
    "UV window film helps prevent sun damage.",
    "Home Window tinting helps preserve the color of fabrics, carpets and hardwood floors.",
    "Block Harmful UV Rays",
    "Most fabrics, furnishings and artwork can be damaged and fade when sunlight passes through untreated windows. By blocking more than 99% of all UV rays, UV window film offers protection for the things you love and have special meaning to you. It will help preserve the color of fabrics, carpets and hardwood floors and help protect fine antiques, woods and works of art from discoloration and fading.",
    "UVA rays streaming through your home windows not only adversely affect your furnishings, but are damaging to your eyes and skin and may contribute to premature aging, and lead to skin cancer. With one out of five Americans developing skin cancer these days, why live with this risk? UV window film is designed to protect against harmful ultraviolet rays. It is a micro thin film that is transparent so you can enjoy the view without the UV.",
    "UV window film has been recommended by dermatologists as another skin safe preventative measure for patients with solar sensitivity, skin related diseases and cancers of the skin. LLumar UV window film carries The Skin Cancer Seal of Recommendation. The seal is awarded to products that protect against skin cancer, like sunscreens. Help change the odds for your family. Make LLumar UV window film part of your sun safety program. You can never be too safe.",
    "Control Heat and Glare",
    "Take control of the sun with residential window tinting. The only thing that will melt is your energy bill.",
    "LLumar window films helps control heat build-up and keeps you comfortable.",
    "Windows are an important part of any home, from the light they let in to views they reveal. However, they can also create a host of problems ranging from excessive glare, heat build-up and high energy costs as you’re forced to run the air conditioner more often to stay comfortable. Residential window tinting with LLumar window films can help you control these problems while providing increased comfort and lower overall energy costs.",
    "Windows play a significant role in regulating heat and energy in your home. According to the EPA Energy Star Buildings Manual in the United States, approximately one-third of an average home's utility bills are wasted by heat loss in winter and heat gain in summer through untreated windows.",
    "Residential window tinting with window films can lower heating and cooling expenses by reducing solar heat from the outside, reducing hot and cold spots inside, and helping to prohibit heat from escaping.",
    "Open your blinds, shades, or drapes and let the sunlight in! LLumar window film reduces glare by up to 87%, making it easier for you to watch television or work on a computer. And because residential window tinting is available in a variety of clear, light and subtle shades, you’ll be able to enjoy your view.",
    "Protective Window Films for Your Family",
    "An extra measure of protection for you and your family.",
    "Protect yourself from broken glass with LLumar safety and security window films.",
    "Accidents and storms can shatter windows without warning, sending flying shards of glass everywhere. It can result in severe injuries to your family and significant damage to your home. This risk can be dramatically reduced with LLumar safety and security window films.",
    "Made with thick, heavy-duty polyester bonded by strong adhesives, these films provide a clear and invisible – yet powerful – barrier that helps hold glass in place in the event of an impact or earthquake. While this barrier helps protect you against the damaging effects of flying shattered glass, it also makes it much more difficult for an intruder to smash through your windows quickly.",
    "LLumar safety and security window films meet the toughest industry standards in the United States, Europe and around the world, so you can trust that you’re using a product that works. And because it is optically clear, you won’t even know it's there – until something happens. Think of it as insurance!",
    "Upgrade Your Windows Without Replacing Them",
    "Energy-saving window film is an affordable alternative to replacing your windows.",
    "A LLumar energy-saving window film installation costs about one-fifth that of replacement windows.",
    "Did you know that as much as one-third of a home’s heating and cooling costs can be lost through windows that are not energy efficient? With home fuel costs going through the roof, you may be considering the purchase of energy-efficient replacement windows. But before you spend thousands of dollars, consider all the savings you’ll enjoy with LLumar.",
    "LLumar energy-saving window film provides an affordable alternative to window replacement when your goal is to improve energy efficiency. LLumar films can help windows that are in good shape, but just not energy efficient. Damaged or deteriorating windows will need to be replaced. The fact is, the cost for quick, professional installation of energy saving window film is about one-fifth the cost of replacement windows! More importantly though:",
    "LLumar energy-saving window film can also lower your home’s cooling costs.",
    "LLumar helps reduce your home's energy consumption, saves you money and also helps the environment.",
    "So choose LLumar and upgrade your windows without replacing them and save all the way around.",
    "Sources: http://northamerica.llumar.com/film-benefits/for-home-owners",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "COMMERCIAL WINDOW TINTING SCHAUMBURG",
    "Lower energy costs and increase tenant comfort with commercial window tinting.",
    "BENEFITS OF COMMERCIAL WINDOW TINTING",
    "1. Increased tenant comfort and reduced tenant complaints",
    "2. Tenant retention due to more usable space – eliminates hot and cold spots",
    "3. Updates building appearance without changing the overall exterior appearance",
    "4. Rapid return on investment",
    "5. Reduce tenant complaints and increase tenant comfort",
    "6. Provides a more uniform appearance of a building",
    "7. Save on heating and cooling causes by filtering what is allowed in and out of your windows.",
    "8. Protect your employees, merchandise, and equipment by blocking 99% of UV rays.",
    "9. Stop glare from direct sun, snow, water, or surrounding buildings.",
    "Energy saving window film reduce utility costs up to 15%",
    "Getting temperature fluctuations under control can get you annual energy savings of up to 15%.",
    "Save Energy",
    "In many buildings, temperature fluctuations (and subsequent energy bills) are due to sunlight streaming through office windows. Too much sun and things heat up. But when the sun shifts or goes down, so does the temperature.",
    "The U.S. Department of Energy estimates that one-third of a building’s cooling load is from solar heat gain through windows, and nearly 75% of existing windows are not energy efficient.",
    "One easy, and cost effective way to keep the temperatures in your building as constant as possible is with LLumar energy-saving window film.",
    "Professional energy audits estimate that buildings retrofitted with LLumar energy-saving window films can realize annual energy savings as high as 15%, with reduced carbon emissions and a payback often as low as three years.",
    "Energy-saving window film vs. window replacement",
    "When you’re deciding between window replacement or installing energy-saving window film on existing windows in a commercial building, a number of factors may affect the choice you make.",
    "Tenant complaints are often an early sign that your building’s windows need attention. New windows don’t always address complaints about heat or glare, and energy-saving window film can’t fix leaks or moisture, so identifying the real problem will help you focus in on the right window solution.",
    "If the windows have air or moisture leakage, failed seals, or damaged frames (or if they aren’t structurally sound), then window film installation isn’t an option to address complaints or window problems. But if your building’s windows are structurally sound and in good condition, window film can often take care of several of the common problems associated with windows in commercial buildings.",
    "Cutting heat and glare for a better work environment",
    "Increase energy savings with solar control window film.",
    "Comfort and Productivity",
    "Increase employee comfort and productivity and save on energy costs with our commercial window film.",
    "Hot and cold tenant calls come with the territory when managing a commercial building. Yes, it can be irritating at times. But it pays not to ignore this important feedback from tenants and occupants. In many cases, what’s good for thermal comfort is also good for your building’s utility bills.",
    "LLumar Solar Control Window Films provide a cost-effective option that can increase both employee and tenant comfort",
    "LLumar solar control window film allows natural light in without glare.",
    "Leaving blind and shades open reduces the need for lamps and overhead lighting – reducing costs – while helping occupants maintain a much desired connection with the outdoors.",
    "We help eliminate hot and cold spots",
    "By reducing heat and solar energy, windows tinted with LLumar window film can help even out the hot and cold spots throughout your building. The result is more satisfied tenants and greater employee comfort.",
    "It also works in attracting premium tenants who more and more are looking for “green upgrades” that can provide proven energy savings.",
    "When comparing costs, it’s important to remember that the latest window film technology is a fraction of what you’d spend for replacement windows. And window film works to reduce the HVAC load.",
    "UV Protection for your building",
    "UV Protection for your building",
    "The sun offers many benefits, such as increased productivity and reduced reliance on electric lighting; but the sun’s UV rays can also damage skin and building assets if they’re not controlled.",
    "UV rays can penetrate windows in commercial buildings, homes and automobiles, exposing occupants and interior furnishings to an invisible danger. UV rays can fade furniture, wall coverings, artwork, fabric,flooring and window merchandise displays. UVA rays are also linked to skin cancer. This exposure is cumulative, so the total damage an occupant receives is directly related to how often they’re exposed to UV rays.",
    "LLumar solar control window film is one of the easiest ways to mitigate UV damage. It can block more than 99% of harmful UV Rays while offering unobstructed views, allowing natural daylight inside. Window films also reduce solar heat gain, which may lower cooling costs. Newer low-e window films offer year-round HVAC savings by helping keep radiant heat inside in the winter and outside in the summer. Window film is recommended by The Skin Cancer Foundation as part of a comprehensive skin care program.",
    "Sources: http://northamerica.llumar.com/film-benefits/commercial",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "FORMULAONE HIGH PERFORMANCE AUTO WINDOW TINT",
    "The Ultimate in Appearance, Comfort and Protection",
    "THE EXCLUSIVE DEALER OF FORMULAONE AUTO WINDOW TINT FOR SCHAUMBURG AND THE GREATER CHICAGO REGION",
    "Raise Your Expectations for FormulaOne High Performance Auto Tint",
    "Get the ultimate in appearance, comfort, and protection with FormulaOne high performance auto tint by LLumar. This exclusive automotive tint is manufactured to meticulous standards and rigorously tested, to help ensure it lives up to the promise of a better driving experience.",
    "FormulaOne is available only through an elite network of LLumar SelectPro Dealers. As a SelectPro Dealer, Umbra Window Tinting has proven consistently offering exceptional customer service and installation skills. So have peace of mind knowing you can trust Umbra Window Tinting to treat you and your vehicle with the utmost attention.",
    "Now drivers can have the ultimate in appearance, comfort and protection from an exclusive line of window tint that creates a driving experience that is like no other.",
    "In just minutes, the hot Chicago summer sun can send the interior temperature of your car skyrocketing to up to 150°F – making your drive not only uncomfortable, but possibly dangerous. With FormulaOne automotive window film from Umbra Window Tinting in Chicago, you can reduce the temperatures inside your car by up to 65% before you even turn the air conditioner on! Say goodbye to blistering leather seats and a blazing steering wheel. FormulaOne car window tinting takes the strain off your air conditioning system, helping you to save on fuel and subsequently costs at the pump. Plus, our informed team members can educate you on Illinois window tinting laws as outlined in bill HB3325. Passed in 2009, this bill allows tinting of front and rear windows on passenger vehicles according to the following guidelines:",
    "Option 1 – Both front and rear windows can be tinted up to 35%.",
    "Option 2 – For darker back windows, you can go up to 30-35% net darkness. However, then the front windows may only have up to 50% tinting.",
    "Option 3 – If rear windows are tinted below 30%, the front windows cannot have a tint. Vehicles equipped with factory rear tint are permitted to have up to 50% tint for front windows.",
    "WHAT ELEVATES FORMULAONE TINT",
    "Advanced Construction",
    "We use our most premium manufacturing techniques, materials and engineering to create long-lasting FormulaOne tint.",
    "Color-Stable Dye",
    "FormulaOne tint has premium charcoal dye embedded in it instead of being applied to the surface for more durability.",
    "UV Ray Protection",
    "Exposure to UV rays contributes to cracking and fading in your vehicle’s interior. FormulaOne blocks 99% of harmful UV rays.",
    "Our Best LIFETIME Warranty",
    "All FormulaOne products come with transferable lifetime limited warranty* coverage that travels with the title of your vehicle.",
    "LLumar SelectPro Dealers",
    "FormulaOne is offered exclusively by this elite group of professionals, recognized for their impeccable service and installation.",
    "When it comes to your car, you never settle for second best. You want the best of everything. That’s why there’s FormulaOne High Performance Window Tint by LLumar — the best in the industry.",
    "Appearance",
    "FormulaOne High Performance Auto Tint by LLumar takes advantage of the latest innovations and technologies to ensure a beautiful, long-lasting appearance – keeping your car’s interior looking newer longer. With a broader range of shades to choose from, you’re sure to -find the one that fits your style.",
    "Comfort",
    "A cooler interior is another reason you’ll be comfortable with your decision. Blocking more heat will help you experience a comfortable cabin environment, allowing you to run your air conditioner less, improving fuel economy.",
    "Performance",
    "It's the difference between style and substance. It's the extra mile that you put into your vehicle and that you expect from the products you buy. FormulaOne High Performance Auto Tint® has been specially designed to give you the highest heat and glare reduction on the market - improving comfort and helping take the strain off of your AC.",
    "Precision",
    "The ability to be precise is the ability to excel. FormulaOne High Performance Auto Tint is manufactured and engineered with the utmost precision by the world's leader in applied films. Every product is backed with a lifetime manufacturer's warranty*. The quality and consistency of our films is matched only by the select few that qualify to be authorized FormulaOne dealers and installers.",
    "Protection",
    "While many films simply look good, FormulaOne High Performance Auto Tint provides you and your vehicle with the highest UV protection in the industry - keeping your car's interior looking newer longer, and helping shield you and your passengers from UV exposure. FormulaOne High Performance Auto Tint provides a protective barrier that reduces glare, while shielding you and your passengers from more than 99 percent of damaging UV rays. It also provides exceptional protection from the sun’s harmful rays, which can cause a vehicle’s interior to fade and crack.",
    "Unmatched Warranty and Support",
    "Not only does FormulaOne High Performance Auto Tint by LLumar add overall comfort to your driving experience, but it also provides you comfort in knowing you are backed by the industry’s best warranty, the unsurpassed FormulaOne National Manufacturer’s Warranty*. Your vehicle is protected for as long as you own it, with a warranty that can be transferred to subsequent vehicle owners.",
    "*Certain restrictions apply; see an authorized dealer for warranty details.",
    "FORMULAONE AUTO WINDOW TINT OPTIONS",
    "High-Quality FormulaOne Auto Tint for Every Need",
    "FORMULAONE SPEC SHEET",
    "Manufactured and engineered with the utmost precision by the world’s leader in applied films, FormulaOne car window film delivers strength and durability unmatched by competitors. It utilizes top-notch materials and high-performance adhesive to keep your vehicle looking as new as the day it rolled off the lot. At Umbra Window Tinting, we offer a wide range of FormulaOne window films, all designed to provide outstanding protection and stylish good looks.",
    "FormulaOne Stratos Series",
    "The most luxurious tint we offer with our highest heat-rejecting power, sun protection and style. Made with concentrated nano-ceramic construction. Our new proprietary hybrid-matrix technology utilizes multiple layers made up of billions of nanoscopic particles to create advanced infrared absorbing properties. This film rejects up to 63% of solar heat to enhance your driving experience. And it shields your passengers from more than 99% of harmful UV rays* while it helps reduce interior fading and cracking due to UV ray exposure.",
    "Our maximum heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Pinnacle Series",
    "The Pinnacle Series delivers the ultimate all-around performance in automotive window tint. The innovative nano-ceramic construction offers our maximum heat and UV protection along with glare reduction without interfering with signals from electronic devices. The Pinnacle Series gives this ultra-premium tint elevated heat rejection and improved glare reduction, along with sleek style.",
    "Outstanding heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Comfort Series",
    "FormulaOne Comfort window tint is a deluxe version of LLumar®’s heat-blocking, glare-fighting metallized and dyed tint. It has tough scratch resistance, premium color-stable dye, and the power to block more than 99% of harmful UV rays. Whether you decide on a dark limo shade or something more subtle, you’ll love the results. Premium film with a metallized layer that helps reflect away the sun’s harsh heat and glare; has a reflective look different from other films.",
    "Excellent heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "FormulaOne Classic Series",
    "When it’s all about the look of your vehicle and the image you want to project, the go-to choice is Classic Series. The soft charcoal look is available in a variety of shades. Select the auto window tint that complements your style then enjoy the enhanced look of your car. Made with our deluxe, deep-dye construction for true charcoal color. Other brands skip this step and are more likely to discolor.",
    "Good heat rejection for improved comfort",
    "Blocks 99% of damaging UV rays",
    "LEARN MORE",
    "AIR Series Clear Window Film",
    "This nearly clear film helps keep your vehicle cooler without the dark appearance of traditional tint. When you want to help protect yourself, your passengers and your car interior from harmful UV rays and you want to reduce interior heat, AIR Series window film is for you. It has the same, proven nano-ceramic construction used in premium auto tint, minus the window-darkening color.",
    "AIR window film is almost impossible to see. But when it comes to comfort and safety, it has a major impact on the way you feel. With LLumar AIR clear window film you get:",
    "LEARN MORE",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "XPEL PAINT PROTECTION FILM",
    "FREE ESTIMATE",
    "EXPLORE XPEL PAINT PROTECTION FILMS",
    "Need Paint Protection Film (AKA Clear Bra)? XPEL offers a variety of self-healing paint protection films and DIY solutions to keep your car looking its best.",
    "ULTIMATE PLUS",
    "Gloss Is Boss",
    "ULTIMATE PLUS is one of the most advanced paint protection films on the market. Available in three different thicknesses to offer you the protection you need for exterior and interior surfaces. The entire ULTIMATE PLUS line up is virtually invisible and provides protection from everyday damages including scuffs, scratches, chips and more. It protects your vehicle's paint from unsightly damage and maximizes re-sale value. Some of its features include Self Healing, Stain Resistance and Superior Optical Clarity.",
    "STEALTH",
    "As Smooth As Satin",
    "Finally, A Paint Protection Film Specifically Formulated For Preserving A Flat Factory Finish. As smooth as satin. Whether your vehicle is matte, magno, frozen or frosted, self-healing STEALTH will keep it looking effortlessly pristine. Or, protect your gloss paint with a whole new look! With an unique satin finish, STEALTH helps match most factory flat paint jobs and virtually disappears on most surfaces. With a finish that’s uniformly smooth, you can add STEALTH to your matte or gloss paint job for a unique satin finish.",
    "ARMOR",
    "It's Rugged By The Roll",
    "XPEL ARMOR provides a textured, bed-liner aesthetic in an easy-to-apply film that's 13 mils thick. Designed for off-road, industrial, and commercial use, ARMOR can give your rig the look you want with the protection it deserves. Rugged protection that defends against scrapes, scratches, scuffs, gravel strikes, and other hazards with protection you can see and feel. ARMOR can be used to cover existing damage on surfaces while simultaneously protecting from new impacts or abrasion for a unified look all around.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "LLUMAR PAINT PROTECTION FILMS (PPF)",
    "Protect your car's paint from scratches, rocks, chips, salt, and whatever hazards the road throws your way with LLumar Clear Bra PPF",
    "DRIVE CONFIDENTLY WITH LLUMAR CLEAR BRA PPF",
    "LLumar Paint Protection Film (PPF) Brands makes it easy to keep your car’s finish looking like you just drove off the lot. Paint protection film effectively stands up to flying rocks, bird droppings, salt, sand and more. We offer multiple finishes, innovative 2-in-1 products, and go-to favorites, all of which are self-healing, extensively tested, and factory-backed. Decide what coverage you need, select your product and take any road with confidence.",
    "Quality you can count on",
    "Proudly made in the U.S.A. of globally sourced materials, LLumar Platinum Paint Protection Film helps protect car finishes from paint chips and scratches. LLumar products are recognized for their outstanding appearance and durability. We proudly stand behind our products. This, along with a reputation for quality and innovation, has made LLumar one of the best-selling and most-respected paint protection film brands in the world.",
    "LLUMAR PAINT PROTECTION FILM (PPF) OPTIONS",
    "Superior Car Paint Protection from the Hazards of the Road",
    "Valor PPF Series",
    "Paint Protection Film + Ceramic Coating Benefits",
    "Get the sought-after benefits of premium PPF and easy-wash ceramic coating with 2-in-1 Valor, featuring our OEM-trusted Tetrashield™ technology.",
    "Super hydrophobic surface with deep gloss",
    "Stands up to corrosives like bird droppings",
    "Select Black PPF Series",
    "Transform your paint color to a rich, glossy black with all the protective benefits of our Platinum PPF.",
    "Transform your paint color to a rich, glossy black with all the protective benefits of our Platinum PPF.",
    "Restyle and protect with just one installation",
    "More affordable than paint and tougher than vinyl",
    "Full wrap or accents on bumpers, mirrors, etc.",
    "Platinum Extra PPF Series",
    "Hard-wearing defense for extreme driving conditions",
    "Our highest impact resistance in a thicker, stronger PPF made for gravel roads, track racing, and harsh weather.",
    "Chip-fighting, high-impact finish defense",
    "Ideal for areas highly vulnerable to damage",
    "Backed by a 10-year limited warranty*",
    "Platinum Gloss PPF Series",
    "Helps defends a new car's finish against the hazards of the road",
    "A favorite of auto enthusiasts and purists; helps your vehicle retain its value by defending the finish.",
    "High-shine top-coat blends with factory paint",
    "HydroGard™ for stain resistance and durability",
    "Platinum Matte PPF Series",
    "Transforms your vehicle’s finish with serious defense",
    "All the features of our Platinum PPF, in a standout flat finish that can transform glossy paint or blend with custom matte paint.",
    "For a flat finish with added protection",
    "Beads water, fights stains and self-heals",
    "Gloss and Matte PPF Series",
    "Keep your shiny or flat finish safe from everyday road damage",
    "Affordable, extensively road-tested, and made to help keep high-shine or flat finishes looking as pristine as possible for years.",
    "Available in gloss or matte finish",
    "Self-heals with sun or engine heat",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "KENZO IGL CERAMIC COATINGS",
    "Approved Installer of IGL Coatings",
    "About Kenzo by IGL Coatings",
    "Kenzo is IGL Coatings' Flagship REACH compliant ceramic coating which pioneered the 100% active material formulation for ceramic coatings. Synthesised using the latest nanotechnology and graphene nano-platelets, the new and improved Graphene Reinforced Ecocoat Kenzo has an increased durability of up to 5 years and a higher resistance to water-spots. Ecocoat Kenzo’s unmatched clarity and gloss radiates a rich and natural glow reminiscence of bespoke wax and its thick 10H hardness layer protects 12 times longer than waxes.",
    "Kenzo is a revolutionary paint protection coating that contains 100% silica providing the highest level of gloss and protection and is backed by an official warranty provided by IGL Coatings and supported by certified IGL Coatings Master Applicator. It forms a layer of thick coating that radiates a rich and natural glow reminiscence of a bespoke wax while providing unmatched protection. Running your hands across a Kenzo coated car is like touching the soft luxurious silk. It will never be the same again. Kenzo IGL Coatings is only available to and exclusively installed by IGL Authorized Kenzo Installers that had mastered the highest level in paint correction and the art of coating application.",
    "Why Kenzo Ceramic Coatings",
    "If you are looking to preserve the value and look of your new prized ride or want your older car to be restored to it's new look and protected from the harsh elements, our Ceramic Coating solutions is your answer. Unlike a car wash & wax that can lasts for only a short period of time, getting your car treated with Ceramic Coating will last for years and will help keep that shine and add protection from bird droppings, water marks, scratches, paint transfer, and whatever the road throws your way. Ceramic coatings also give the great hydrophobic benefits of allowing water and dirt to run right off your vehicle. This makes cleaning your car, truck, or SUV even easier.",
    "Benefits of Kenzo IGL Ceramic Coatings:",
    "Preserve the original paintwork",
    "Reduced paint marring",
    "Reduced contaminants etching",
    "Ease of cleaning",
    "Extremely deep rich gloss ( hard candy shell appearance)",
    "Protection from UV rays",
    "Resistance to extreme temperatures",
    "Resistance to stains, bird droppings, water spots, traffic film",
    "Repels water, oil, dirt",
    "Super thick layer",
    "Warranty",
    "Kenzo Ceramic Coatings improves resistance against:",
    "Sunshine & UV",
    "Acid Rain",
    "Bird Droppings",
    "Water spots",
    "Brake Dust",
    "Chemicals",
    "Insects & Bugs",
    "Paint Marring",
    "Road Grit",
    "Rust",
    "Tree Sap",
    "HIGH SOLIDS",
    "100% active material content and 0% solvent creating a thick film build",
    "EXTREME HARDNESS",
    "Crosslinks and full cures to hardness of up to 10H (pencil scale)",
    "SELF CLEANING",
    "Surface stays clean for a longer period thanks to the self cleaning effect",
    "SILKY SMOOTH SURFACE",
    "First coating to provide a texture similar to soft luxurious silk that rivals bespoke wax",
    "WATERSPOT RESISTANCE",
    "Improved formulation to increase the resistance of water spotting on coated vehicles",
    "SUPERB HYDROPHOBIC QUALITY",
    "Water contact angle that surpasses 120° and retaining close to this angle for a long period",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "AUTO WINDOW FILM VIEWER",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "PAINT PROTECTION FILM VIEWER",
    "WHERE CAN AUTOMOTIVE PAINT PROTECTION FILM BE INSTALLED?",
    "This invisible bra or clear bra for cars can be added to the areas of your vehicle that are most vulnerable to damage such as the hood, bumpers, door edges, handles and steps, side-view mirrors, rocker panels and fenders. Click on the name of the car section below to see where the paint protection film can be applied.",
    "What makes our paint protection film for cars different?",
    "The first scratch hurts the most. So prevent the pain and keep your car looking newer longer with one of highest quality, most durable paint protection films in the industry. High-gloss and virtually invisible to the naked eye, LLumar® Self-Healing Paint Protection Film shields your car from the damages of everyday driving. It’s the ultimate defense against road rash: rocks and pebbles, road debris, road salt and sand.",
    "With best-in-class quality and clarity, LLumar Self-Healing Paint Protection Film has outstanding durability to stand up against the hazards of the road.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "GET FREE ESTIMATE NOW!",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Color:",
    "Service:",
    "Auto Window Tinting",
    "Paint Protection Film",
    "Ceramic Coating",
    "Other",
    "Select:",
    "2 DR",
    "4 DR",
    "Hatch",
    "Wagon",
    "Other",
    "Old tint need to be removed?",
    "Yes",
    "No",
    "Shop Location",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comment:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "AUTO WINOW TINTING FREE ESTIMATE",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Select:",
    "2DR",
    "4DR",
    "Hatch",
    "Wagon",
    "Other",
    "Old tint need to be removed?",
    "Yes",
    "No",
    "Shop Location:",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comments:",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "PAINT PROTECTION FILM FREE ESTIMATE",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Shop Location:",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comments:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "CERAMIC COATING FREE ESTIMATE",
    "Name:",
    "Email:",
    "Phone:",
    "Make:",
    "Model:",
    "Year:",
    "Shop Location:",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comments:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "RESIDENTIAL WINDOW TINTING FREE ESTIMATE",
    "Name:",
    "Email:",
    "Phone:",
    "City/Address/Zip Code",
    "How did you find us?",
    "Best time to call:",
    "8am - 11am",
    "11am - 2pm",
    "2pm - 5pm",
    "After 5pm",
    "Shop Location:",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comments:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "COMMERCIAL WINDOW TINTING FREE ESTIMATE",
    "Name:",
    "Email:",
    "Phone:",
    "Business Name:",
    "City/Address/Zip Code",
    "How did you find us?",
    "Best time to call:",
    "8am - 11am",
    "11am - 2pm",
    "2pm - 5pm",
    "After 5pm",
    "Shop Location:",
    "Schaumburg",
    "Glendale Heights",
    "No preference",
    "Comments:",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "WELCOME TO UMBRA WINDOW TINTING IN SCHAUMBURG & GLENDALE HEIGHTS",
    "The Premier Window Tinting, Paint Protection Film (PPF), and Ceramic Coating Company for Schaumburg, Glendale Heights and The Greater Chicago Region Since 2002",
    "See Why Customers in Schaumburg and The Greater Chicago Region Love and Trust Umbra Window Tinting For All Their Window Tinting, Paint Protection Film, & Ceramic Coating Needs",
    "UMBRA WINDOW TINTING SERVICES",
    "AUTO WINDOW TINTING",
    "LEARN MORE",
    "PAINT PROTECTION FILM",
    "LEARN MORE",
    "CAR CERAMIC COATING",
    "LEARN MORE",
    "GET FREE ESTIMATE NOW",
    "CLICK HERE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "UMBRA WINDOW TINTING SERVICE AREAS",
    "Umbra Window Tinting has serviced thousands of car owners and car enthusiasts throughout Schaumburg and all over the Chicago Metropolitan Area, Northwest Suburbs, and Western Suburbs of Cook County and DuPage County. Service area cities include Schaumburg (Home of Woodfield Mall), Glendale Heights, Hoffman Estates, Streamwood, Arlington Heights, Barrington, South Barrington, Buffalo Grove, Deerfield, Addison, Des Plaines, Elk Grove Village, Elmwood Park, Grayslake, Itasca, Morton Grove, Mount Prospect, Niles, Carol Stream, Bloomingdale, Elmhurst, Lombard, Oak Brook, Wheaton, Wood Dale, Bensenville, Roselle, Villa Park, Downers Grove, Franklin Park, Oak Park, Des Plaines, Elgin, Naperville, Inverness, Palatine, Crystal Lake, McHenry, and the surrounding Chicagoland Suburban Areas. We even have car owners that will drive from as far as downtown, Chicago just receive our trusted 5 star reviewed Window Tinting, Paint Protection Film (PPF), and Ceramic Coating services.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "WELCOME TO UMBRA WINDOW TINTING IN SCHAUMBURG & GLENDALE HEIGHTS",
    "The Premier Window Tinting, Paint Protection Film (PPF), and Ceramic Coating Company for Schaumburg, Glendale Heights and The Greater Chicago Region Since 2002",
    "See Why Customers in Schaumburg and The Greater Chicago Region Love and Trust Umbra Window Tinting For All Their Window Tinting, Paint Protection Film, & Ceramic Coating Needs",
    "UMBRA WINDOW TINTING SERVICES",
    "AUTO WINDOW TINTING",
    "LEARN MORE",
    "PAINT PROTECTION FILM",
    "LEARN MORE",
    "CAR CERAMIC COATING",
    "LEARN MORE",
    "GET FREE ESTIMATE NOW",
    "CLICK HERE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "UMBRA WINDOW TINTING SERVICE AREAS",
    "Umbra Window Tinting has serviced thousands of car owners and car enthusiasts throughout Schaumburg and all over the Chicago Metropolitan Area, Northwest Suburbs, and Western Suburbs of Cook County and DuPage County. Service area cities include Schaumburg (Home of Woodfield Mall), Glendale Heights, Hoffman Estates, Streamwood, Arlington Heights, Barrington, South Barrington, Buffalo Grove, Deerfield, Addison, Des Plaines, Elk Grove Village, Elmwood Park, Grayslake, Itasca, Morton Grove, Mount Prospect, Niles, Carol Stream, Bloomingdale, Elmhurst, Lombard, Oak Brook, Wheaton, Wood Dale, Bensenville, Roselle, Villa Park, Downers Grove, Franklin Park, Oak Park, Des Plaines, Elgin, Naperville, Inverness, Palatine, Crystal Lake, McHenry, and the surrounding Chicagoland Suburban Areas. We even have car owners that will drive from as far as downtown, Chicago just receive our trusted 5 star reviewed Window Tinting, Paint Protection Film (PPF), and Ceramic Coating services.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "PHOTO GALLERY – VIEW OUR PROJECTS IN ACTION!",
    "We know seeing is believing! That’s why we’ve put together a collection of photos highlighting some of the LLumar window tint and paint protection film jobs we’ve completed across the Chicago metro region. Whether it’s a sports car, truck or sedan, we hope you notice our attention is always in the details. Inspired by something you see? For more information, contact Umbra Window Tinting and we’ll provide you with a free estimate to help make the dreams for your vehicle a reality.",
    "To see more photos of our work visit our Facebook and Instagram Pages",
    "Just click on desired thumbnail to view full image",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:",
    "HOME",
    "SERVICES",
    "AUTO WINDOW TINTING",
    "FORMULAONE AUTO TINT",
    "PAINT PROTECTION FILM",
    "XPEL PPF",
    "LLUMAR PPF",
    "CERAMIC COATING",
    "KENZO IGL COATINGS",
    "RESIDENTIAL FILM",
    "COMMERCIAL FILM",
    "PRODUCTS",
    "FORMULAONE TINT",
    "XPEL PPF",
    "LLUMAR PPF",
    "KENZO IGL COATINGS",
    "FILM VIEWERS",
    "AUTO WINDOW FILM VIEWER",
    "PAINT PROTECTION FILM VIEWER",
    "FREE ESTIMATE",
    "AUTO WINDOW TINT",
    "PAINT PROTECTION FILM",
    "CERAMIC COATING",
    "RESIDENTIAL TINTING",
    "COMMERCIAL TINTING",
    "ABOUT",
    "OVER 500 5 STAR REVIEWS",
    "OUR WORK",
    "CONTACT",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "FREE ESTIMATE",
    "(847) 912-1869",
    "CONTACT UMBRA WINDOW TINTING",
    "Have a question or want to set up an appointment? We would love to hear from you.",
    "Name:",
    "Email:",
    "Phone:",
    "Message:",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "UMBRA WINDOW TINTING SERVICE AREAS",
    "Umbra Window Tinting has serviced thousands of car owners and car enthusiasts throughout Schaumburg and all over the Chicago Metropolitan Area, Northwest Suburbs, and Western Suburbs of Cook County and DuPage County. Service area cities include Schaumburg (Home of Woodfield Mall), Glendale Heights, Hoffman Estates, Streamwood, Arlington Heights, Barrington, South Barrington, Buffalo Grove, Deerfield, Addison, Des Plaines, Elk Grove Village, Elmwood Park, Grayslake, Itasca, Morton Grove, Mount Prospect, Niles, Carol Stream, Bloomingdale, Elmhurst, Lombard, Oak Brook, Wheaton, Wood Dale, Bensenville, Roselle, Villa Park, Downers Grove, Franklin Park, Oak Park, Des Plaines, Elgin, Naperville, Inverness, Palatine, Crystal Lake, McHenry, and the surrounding Chicagoland Suburban Areas. We even have car owners that will drive from as far as downtown, Chicago just receive our trusted 5 star reviewed Window Tinting, Paint Protection Film (PPF), and Ceramic Coating services.",
    "FREE ESTIMATE",
    "SCHAUMBURG LOCATION",
    "811 W Higgins Rd # B",
    "Schaumburg, IL 60195",
    "(847) 912-1869",
    "GLENDALE HEIGHTS LOCATION",
    "2021 Bloomingdale Rd.",
    "Glendale Heights, IL 60139",
    "(224) 353-6624",
    "BUSINESS HOURS",
    "Monday - Friday: 8am to 6pm",
    "Saturday: 8am to 4pm",
    "Sunday: CLOSED",
    "© 2024",
    "All Rights Reserved | Umbra Window Tinting",
    "Share by:"
  ]
}